# ClearTransmitted Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingSaveAsOptions..::..ClearTransmitted Property
WorksharingSaveAsOptions Class See Also
---
For a transmitted model opened with DetachAndPreserveWorksets, clear its transmitted flag in the Save/SaveAs operation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ClearTransmitted { get; set; }
```

Visual Basic
---
```text
Public Property ClearTransmitted As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ClearTransmitted {
	bool get ();
	void set (bool value);
}
```

# See Also
WorksharingSaveAsOptions Class
Autodesk.Revit.DB Namespace